# 一、爬虫工作流程
#        1、请求地址
#            找网址：https://www.baidu.com/
#        2、发送请求获取响应
#            发送请求：地址栏输入网址，然后回车
#            获取响应：默认的【网站给的页面】
#        3、解析内容
#            找到自己想要的内容
#        4、保存数据
#            把数据保存
# 二、学习方式
#  1、敲代码
#      -学会语法【理解代码】：根据代码写自己的理解注释
#      -学会使用：删掉代码，根据注释补上自己的代码
#      -运用：先编辑好自己的逻辑【注释】，然后根据自己的逻辑完成代码
#  2、看视频
#      -找问题【千万不要做笔记】
#      -解决问题
#      -巩固
#  3、笔记
#     一定要记
#     -记理解
#     -格式
#         响应对象 = requests.请求方式(url=网址，headers=请求头字典）
#     -你的运用
#         写的代码
#
# 三、什么是爬虫
#     网络爬虫：网页蜘蛛，网络机器人
#     网页蜘蛛：
#         -网络机器人【程序】
#         -互联网
#         -爬虫程序在互联网上面爬，抓取数据
#       爬虫就是在网络上面抓取数据的程序
#       本质上就是，用户能做到的，爬虫也能做到；用户做不到的，爬虫也做不到
#     学爬虫，一定不要学死的某个网站的爬取方法，学的是思路
















